Revit 2024 API
PipeFittingAndAccessoryData.GetFamilyInstanceId Method
 Gets the Id of the fiting or accessory instance
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId GetFamilyInstanceId()
Visual Basic
Public Function GetFamilyInstanceId As ElementId
Visual C++
public:
ElementId^ GetFamilyInstanceId()
Return Value
 The element Id of the fiting or accessory instance.
See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace